; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-2-6-156)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p1-3 - location
	p0-1 - location
	p0-3 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s2)
	(at driver4 s2)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s0)
	(at package2 s3)
	(at package3 s1)
	(at package4 s2)
	(at package5 s2)
	(at package6 s1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 93)
	(= (time-to-walk p1-3 s1) 93)
	(= (time-to-walk s3 p1-3) 60)
	(= (time-to-walk p1-3 s3) 60)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 64)
	(= (time-to-walk p0-1 s0) 64)
	(= (time-to-walk s1 p0-1) 19)
	(= (time-to-walk p0-1 s1) 19)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 96)
	(= (time-to-walk p0-3 s0) 96)
	(= (time-to-walk s3 p0-3) 98)
	(= (time-to-walk p0-3 s3) 98)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 43)
	(= (time-to-drive s0 s3) 43)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 76)
	(= (time-to-drive s2 s3) 76)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 56)
	(= (time-to-drive s0 s1) 56)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 78)
	(= (time-to-drive s0 s2) 78)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 23)
	(= (time-to-drive s1 s2) 23)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s1)
	(at truck1 s3)
	(at truck2 s3)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	(at package4 s2)
	(at package5 s3)
	(at package6 s3)
	))

(:metric minimize (+ (* 3 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 11
2. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 780
   goals met: 2 of 11
3. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 11
4. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 780 to 1638
   goals met: 2 of 11
5. (load-truck package5 truck1 s2)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 11
6. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1638 to 2652
   goals met: 2 of 11
7. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 11
8. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 2652 to 3380
   goals met: 2 of 11
9. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 3 of 11
10. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 11
11. (load-truck package3 truck1 s1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 11
12. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 3 of 11
13. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 3380 to 4276
   goals met: 3 of 11
14. (drive-truck truck2 s3 s2 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 4276 to 5112
   goals met: 2 of 11
15. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 3 of 11
16. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 5112 to 5365
   goals met: 3 of 11
17. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 4 of 11
18. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 5365 to 5595
   goals met: 4 of 11
19. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 5 of 11
20. (drive-truck truck1 s0 s3 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 5595 to 6154
   goals met: 6 of 11
21. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 6 of 11
22. (unload-truck package5 truck1 s3)
   deleted: (in package5 truck1)
   added: (at package5 s3)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 11
23. (unload-truck package6 truck1 s3)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 8 of 11
24. (drive-truck truck1 s3 s0 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 6154 to 6584
   goals met: 7 of 11
25. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 8 of 11
26. (drive-truck truck2 s2 s3 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 6584 to 7344
   goals met: 9 of 11
27. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 9 of 11
28. (disembark-truck driver4 truck2 s3)
   deleted: (driving driver4 truck2)
   added: (at driver4 s3) (empty truck2)
   goals met: 9 of 11
29. (drive-truck truck1 s0 s3 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 7344 to 7774
   goals met: 10 of 11
30. (walk driver4 s3 p1-3)
   deleted: (at driver4 s3)
   added: (at driver4 p1-3)
   goals met: 10 of 11
31. (walk driver4 p1-3 s1)
   deleted: (at driver4 p1-3)
   added: (at driver4 s1)
   goals met: 11 of 11
